<a href="https://colab.research.google.com/github/hazmicokro/Data-Literate-Bootcamp-2020/blob/main/weekly_task_2_M_Hazmi_Cokro_Mandiri.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# SF Salaries Exercise

Selamat datang di latihan untuk melatih keterampilan pandas Anda! Kami menggunakan Dataset SF Salaries dari [Kaggle!](https://www.kaggle.com/kaggle/sf-salaries) Cukup ikuti dan selesaikan tugas yang diuraikan di bawah ini. Tugas akan semakin sulit seiring berjalannya waktu.

**import library pandas as pd**

In [ ]:
import pandas as pd

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
%cd '/content/drive/MyDrive/weekly_task_2_M Hazmi Cokro Mandiri'

/content/drive/MyDrive/weekly_task_2_M Hazmi Cokro Mandiri

In [ ]:
!unzip 'Lemonade Final - Hazmi Cokro Weekly 2.zip' &> /dev/null && rm *.zip

Archive:  Lemonade Final - Hazmi Cokro Weekly 2.zip
  inflating: Lemonade Final - Hazmi Cokro Weekly 2.xlsx

In [ ]:
!unzip Salaries.zip &> /dev/null && rm *.zip

Archive:  Salaries.zip
  inflating: Salaries.csv

**baca file Salaries.csv sebagai dataframe bernama sal.**

In [ ]:
sal=pd.read_csv('/content/drive/MyDrive/weekly_task_2_M Hazmi Cokro Mandiri/Salaries.csv')

**cek head dari DataFrame**

In [ ]:
sal.head(5)

   Id       EmployeeName  ...         Agency  Status
0   1     NATHANIEL FORD  ...  San Francisco     NaN
1   2       GARY JIMENEZ  ...  San Francisco     NaN
2   3     ALBERT PARDINI  ...  San Francisco     NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4   5    PATRICK GARDNER  ...  San Francisco     NaN

[5 rows x 13 columns]

Gunakan .info() untuk mengetahui berapa banyak entri yang ada

In [ ]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

**Berapakah rata-rata dari BasePay?**

In [ ]:
sal['BasePay'].mean()

66325.44884050643

**Berapakah nilai tertinggi dari OvertimePay?**

In [ ]:
sal['OvertimePay'].max()

245131.88

**Apa pekerjaan dari JOSEPH DRISCOLL?**

*Catatan: Gunakan huruf besar semua, jika tidak, Anda mungkin mendapatkan jawaban yang tidak cocok (ada juga huruf kecil Joseph Driscoll)*

In [ ]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

**Berapa penghasilan JOSEPH DRISCOLL (termasuk keuntungannya)?**

In [ ]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

**Siapa nama orang yang dibayar paling tinggi (termasuk tunjangan)?**

In [ ]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()]

   Id    EmployeeName  ... Status  title_length
0   1  NATHANIEL FORD  ...    NaN            46

[1 rows x 14 columns]

**Siapa nama orang yang dibayar paling rendah (termasuk tunjangan)? Apakah Anda memperhatikan sesuatu yang aneh tentang berapa banyak dia dibayar?**

In [ ]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].min()]

            Id EmployeeName  ... Status  title_length
148653  148654    Joe Lopez  ...    NaN            26

[1 rows x 14 columns]

**Berapa rata-rata BasePay dari semua karyawan per tahun?**

In [ ]:
sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

**Ada berapa banyak job titles?**

*Catatan : Unique job titles*

In [ ]:
sal['JobTitle'].nunique()

2159

**Apa 5 pekerjaan paling umum teratas?**

In [ ]:
sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

**Berapa Pekerjaan yang diwakili oleh hanya satu orang pada tahun 2013?**

*CATATAN: Pekerjaan dengan hanya satu kemunculan di 2013*

In [ ]:
sum(sal[sal['Year']==2013]['JobTitle'].value_counts()==1)

202

**Berapa banyak orang yang memiliki kata Chief dalam jabatannya?**

In [ ]:
def kata_chief(kc):
    if 'chief' in kc.lower():
        return True
    else:
        return False

total_Chief = sum(sal['JobTitle'].apply(lambda kc: kata_chief(kc)))
print(f"Jumlah Chief = {total_Chief}")

Jumlah Chief = 627

**Bonus: Apakah ada korelasi antara panjang string Pekerjaan dan Gaji?**

In [ ]:
sal['title_length']=sal['JobTitle'].apply(len)
sal[['TotalPayBenefits','title_length']].corr()

                  TotalPayBenefits  title_length
TotalPayBenefits          1.000000     -0.036878
title_length             -0.036878      1.000000